from figure import Figure

class LFigure(Figure):
	def __init__(self):
		super().__init__(1)
		#заполнение ячеек для фигуры в разных состояниях вращения
        #ключ - состояние вращения, значение - заполненные ячейки
		self.cells = {
			0: [(2, 0), (0, 1), (1, 1), (2, 1)],
			1: [(1, 0), (1, 1), (1, 2), (2, 2)],
			2: [(0, 1), (1, 1), (2, 1), (0, 2)],
			3: [(0, 0), (1, 0), (1, 1), (1, 2)] 
        }


class JFigure(Figure):
    def __init__(self):
        super().__init__(2)
        self.cells = {
            0: [(0, 0), (0, 1), (1, 1), (2, 1)],
            1: [(1, 0), (2, 0), (1, 1), (1, 2)],
            2: [(0, 1), (1, 1), (2, 1), (2, 2)],
            3: [(1, 0), (1, 1), (0, 2), (1, 2)]
        }


class IFigure(Figure):
    def __init__(self):
        super().__init__(3)
        self.cells = {
            0: [(0, 1), (1, 1), (2, 1), (3, 1)],
            1: [(2, 0), (2, 1), (2, 2), (2, 3)],
            2: [(0, 2), (1, 2), (2, 2), (3, 2)],
            3: [(1, 0), (1, 1), (1, 2), (1, 3)]
        }
        self.move(0, -1)


class SFigure(Figure):
    def __init__(self):
        super().__init__(4)
        self.cells = {
            0: [(1, 0), (2, 0), (0, 1), (1, 1)],
            1: [(1, 0), (1, 1), (2, 1), (2, 2)],
            2: [(1, 1), (2, 1), (0, 2), (1, 2)],
            3: [(0, 0), (0, 1), (1, 1), (1, 2)]
        }


class TFigure(Figure):
    def __init__(self):
        super().__init__(5)
        self.cells = {
            0: [(1, 0), (0, 1), (1, 1), (2, 1)],
            1: [(1, 0), (1, 1), (1, 2), (2, 1)],
            2: [(0, 1), (1, 1), (2, 1), (1, 2)],
            3: [(1, 2), (0, 1), (1, 1), (1, 0)]
        }


class ZFigure(Figure):
    def __init__(self):
        super().__init__(6)
        self.cells = {
            0: [(0, 0), (1, 0), (1, 1), (2, 1)],
            1: [(2, 0), (1, 1), (2, 1), (1, 2)],
            2: [(0, 1), (1, 1), (1, 2), (2, 2)],
            3: [(1, 0), (0, 1), (1, 1), (0, 2)]
        }


class OFigure(Figure):
    def __init__(self):
        super().__init__(7)
        self.cells = {0: [(0, 0), (1, 0), (0, 1), (1, 1)]}
        self.move(1, 0)